# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# brew "gnupg"
brew "hugo"
brew "nginx"

# brew "unrar"
cask "visual-studio-code"
cask "iterm2"
cask "sublime-merge"
cask "docker"
cask "spotify"
cask "dash"
cask "alfred"
cask "dropbox"

# Programming languages
brew "go"
brew "node"

# Browsers
cask "google-chrome"

# Fonts
cask "font-fira-code"
cask "font-hasklig"