cask_args appdir: "/Applications", require_sha: true

# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

# Programming languages
# brew "go"
brew "node@16", conflicts_with: ["node"], link: true

brew "gnupg"
brew "pinentry-mac"
brew "docker"
brew "docker-compose"
brew "syncthing", restart_service: true
# brew "hugo"
# brew "nginx"
# brew "unrar"
# Mac App Store command line interface
# brew 'mas'


cask "alfred"
cask "dropbox"
cask "visual-studio-code"
cask "iterm2"
cask "goland"
cask "telegram"
cask "intellij-idea"
cask "sublime-merge"
cask "spotify"
cask "synology-drive"
cask "figma"
cask "zoom"
# cask "dash"

# Browsers
cask "google-chrome"

# Fonts
cask "font-fira-code"
cask "font-hasklig"

# mas "1Password", id: 443987910